# lab-sql-python-connection
In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

1. Establish a connection between Python and the Sakila database.

2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

    * engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
    * month: an integer representing the month for which rental data is to be retrieved.
    * year: an integer representing the year for which rental data is to be retrieved.
The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [1]:
# import libraries
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()

In [3]:
# establish a connection between python and the sakila database
#'mysql+pymysql://database_user:'+password+'@ip/database_name'
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)


# I want to check whether I have established the connection successfully, therefore I checked chatGPT and find the below code:
try:
    # Attempt to create an engine (establish a connection)
    engine = create_engine(connection_string)
    
    # If the engine is successfully created, print a success message
    print("Connection to MySQL database established successfully!")

except OperationalError as e:
    # If there's an error, print the error message
    print(f"Error: {e}")

Connection to MySQL database established successfully!

In [9]:
# 2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. 
def rental_months (engine: object, month:int, year:int)->pd.DataFrame:
    '''
    This function take 3 parameters (engine, month, year) and execute a SQL query to retrieve the rental data for the given month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

    inputs:
    engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
    month: an integer representing the month for which rental data is to be retrieved.
    year: an integer representing the year for which rental data is to be retrieved.

    output:
    rental_data: Pandas DataFrame
    '''
    rental_data = pd.read_sql_query(f'select * from rental where month(rental_date)= {month} and year(rental_date)= {year}', engine)
    return rental_data

In [17]:
# test rental_months function
rental_may_2005 = rental_months(engine, 5, 2005)
rental_may_2005.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [52]:
rental_may_2005.iloc[0,1].year

2005

In [65]:
# 3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year 
# and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.
# The function should also include the month and year as parameters and use them to name the new column according to the month and year,
# for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

def rental_count_month(df, month, year):
    df2 = df.groupby('customer_id')[['rental_id']].count()
    df2.columns = [ f'rentals_{month}_{year}']
    df2 = df2.reset_index()
    return df2

In [66]:
# function rental_count_month without using month, year inputs but to extract from the df input (as one might pass month, year values that do not match the df data;
#  and in the above function, it was not checked or controlled)
def rental_count_month_adjust(df):
    df2 = df.groupby('customer_id')[['rental_id']].count()
    month = df.iloc[0,1].month
    year = df.iloc[0,1].year
    df2.columns = [ f'rentals_{month}_{year}']
    df2 = df2.reset_index()
    return df2

In [67]:
# test rental_count_month function
rental_count_5_2005 = rental_count_month(rental_may_2005, 5 , 2005)
rental_count_5_2005

     customer_id  rentals_5_2005
0              1               2
1              2               1
2              3               2
3              5               3
4              6               3
..           ...             ...
515          594               4
516          595               1
517          596               6
518          597               2
519          599               1

[520 rows x 2 columns]

In [68]:
# test rental_count_month_adjust function
rental_count_5_2005_adjust = rental_count_month_adjust(rental_may_2005)
rental_count_5_2005_adjust

     customer_id  rentals_5_2005
0              1               2
1              2               1
2              3               2
3              5               3
4              6               3
..           ...             ...
515          594               4
516          595               1
517          596               6
518          597               2
519          599               1

[520 rows x 2 columns]

In [69]:
rental_6_2005 = rental_months(engine, 6, 2005)
rental_count_6_2005 = rental_count_month(rental_6_2005,6,2005)
display(rental_count_6_2005.shape)
rental_count_5_2005 = rental_count_month(rental_may_2005, 5 , 2005)
display(rental_count_5_2005.shape)
merge = rental_count_5_2005.merge(rental_count_6_2005, how = 'outer', on='customer_id' )
merge
merge['diff'] = np.abs(merge['rentals_5_2005'] - merge['rentals_6_2005'])
merge

(590, 2)

(520, 2)

     customer_id  rentals_5_2005  rentals_6_2005  diff
0              1             2.0             7.0   5.0
1              2             1.0             1.0   0.0
2              3             2.0             4.0   2.0
3              5             3.0             5.0   2.0
4              6             3.0             4.0   1.0
..           ...             ...             ...   ...
593          583             NaN             6.0   NaN
594          585             NaN             4.0   NaN
595          591             NaN             3.0   NaN
596          592             NaN             5.0   NaN
597          598             NaN             1.0   NaN

[598 rows x 4 columns]

In [71]:
# 4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years.
# The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.
def compare_rentals (df1, df2):
    if ('customer_id' in df1.columns) and ('customer_id' in df2.columns):
        df3 = df1.merge(df2, how = 'outer', on = 'customer_id' )
        df3['number_rental_difference'] = np.abs(df3[list(df1.columns)[1]] - df3[list(df2.columns)[1]])
        return df3
    else:
        print("the customer_id column is not present in one of the dataframe inputs")

In [72]:
# testing compare_rentals function
compare_rentals(rental_count_5_2005, rental_count_6_2005)

     customer_id  rentals_5_2005  rentals_6_2005  number_rental_difference
0              1             2.0             7.0                       5.0
1              2             1.0             1.0                       0.0
2              3             2.0             4.0                       2.0
3              5             3.0             5.0                       2.0
4              6             3.0             4.0                       1.0
..           ...             ...             ...                       ...
593          583             NaN             6.0                       NaN
594          585             NaN             4.0                       NaN
595          591             NaN             3.0                       NaN
596          592             NaN             5.0                       NaN
597          598             NaN             1.0                       NaN

[598 rows x 4 columns]